#+title: numpy.column_stack将1darray转换为2darray中的列
#+roam_tags: 
#+roam_alias: 

* 概括
* 主要内容
=numpy.column_stack()= 的参数是 =ndarray= 构成的 =tuple= ，各个 =ndarray= 的第一个维度必须相同。
#+begin_src python
# import library
import numpy as np
 
# create 1d-array
a = np.array((1,2,3,4))
 
# create 1d-array
b = np.array((5,6,7,8))
 
# convert 1d-arrays into
# columns of 2d-array
c = np.column_stack((a, b)) 
 
print(c)
#+end_src

#+RESULTS:
: [[1 5]
:  [2 6]
:  [3 7]
:  [4 8]]

* 参考
https://www.geeksforgeeks.org/how-to-convert-1-d-arrays-as-columns-into-a-2-d-array-in-python/
